{"pageProps":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    a: \"a\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: _jsx(_components.a, {\n        href: \"https://www.pexels.com/photo/two-people-holding-macbook-pro-1181275/\",\n        children: \"Photo by Christina Morillo\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Recuerde que el objetivo es reducir el tiempo de ciclo. Comience con la canalización de versión. ¿Cuánto tiempo lleva implementar un cambio en una línea de código o configuración? En última instancia, ese es el freno de la velocidad.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"La integración continua impulsa la fusión en curso y la prueba de código, que permite la detección temprana de defectos. Entre otras ventajas se incluye menos tiempo perdido en la lucha de problemas de fusión y comentarios rápidos para los equipos de desarrollo.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Compilación correcta. Completada.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"La entrega continua de soluciones de software a entornos de producción y prueba ayuda a las organizaciones a corregir rápidamente los errores y responder a los requisitos empresariales en constante cambio.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Entrega continua de soluciones de software en entornos de producción y prueba e imagen de fases.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"El control de versiones, normalmente con un repositorio basado en GIT, permite a los equipos ubicados en cualquier lugar del mundo comunicarse eficazmente durante las actividades de desarrollo diarias. Además, realice integraciones con herramientas de desarrollo de software para supervisar actividades como implementaciones.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Representación de ramas de elemento maestro, característica 1 y característica 2.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Use las técnicas de planeamiento Agile y administración de proyectos lean para: Planear y aislar el trabajo en sprints. - Administrar la capacidad del equipo y ayudar a los equipos a adaptarse rápidamente a las cambiantes necesidades empresariales. - Una definición de Hecho de DevOps es que el software de trabajo recopile telemetría en relación con los objetivos empresariales previstos.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Panel Kanban con columnas de tareas pendientes, en curso, listas para la programación, en curso, listas, en curso, en revisión y hechas.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Supervisión y registro de aplicaciones en ejecución. Incluir entornos de producción para el mantenimiento de las aplicaciones y el uso por parte del cliente. Ayuda a las organizaciones a crear una hipótesis y a validar o desaprobar estrategias rápidamente. Los datos enriquecidos se capturan y almacenan en distintos formatos de registro.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Ejemplo de gráficos.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Las nubes públicas e híbridas han hecho que lo imposible sea fácil. La nube ha quitado los cuellos de botella tradicionales y ha ayudado a mercantilizar la infraestructura. Puede usar la infraestructura como servicio (IaaS) para migrar mediante lift-and-shift las aplicaciones existentes o Plataforma como servicio (PaaS) para obtener una productividad sin precedentes. La nube proporciona un centro de datos sin límites.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Nube pública.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Infraestructura como código (IaC): permite la automatización y validación de la creación y desmontaje de entornos para contribuir a ofrecer plataformas de hospedaje de aplicaciones seguras y estables.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Representación de infraestructura como código (IaC).\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Use la arquitectura de microservicios para aislar los casos de uso empresariales en pequeños servicios reutilizables que se comunican mediante contratos de interfaz. Esta arquitectura permite la escalabilidad y la eficacia.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Representación monolítica y de microservicios.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Los contenedores son la siguiente evolución en el campo de la virtualización. Son mucho más ligeras que las máquinas virtuales, permiten una hidratación mucho más rápida y configurar archivos fácilmente.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Contenedores.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"DevOps puede doler al principio.\\nSi duele, hágalo con más frecuencia. Al igual que ir al gimnasio, es probable que la adopción de nuevas prácticas le duela al principio. Cuanto más se ejercen las nuevas técnicas, más fáciles serán.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Al igual que el entrenamiento en el gimnasio, donde primero se ejercitan los músculos grandes y, luego, los pequeños, adopte prácticas que tengan el impacto más significativo. Entrenar de forma cruzada para desarrollar sinergias.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Una persona está realizando ejercicios que muestran que será más fácil cuando sea más fuerte.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Nota\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"El artículo de origen define DevOps.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Siguiente unidad: Identificación de los equipos de transformación\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontMatter":{"slug":"02-basededatos","title":"BASE DE DATOS","date":"October 20 2022","author":"Alexis Chavez","category":"Azure","post_id":2,"main_image":"pexels-lukas.jpg","main_image_author":"Foto de Aleksandar Pasaric"}},"__N_SSG":true}